Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.RemoveUpdatingSharedParameter(Autodesk.Revit.DB.ElementId)
Remove existing shared parameter as a dependency for the calculation of the rebar curves.
Remarks:
The input parameter needs to be bound to the Rebar element
The rebar element needs to have a valid external server
parameterId:
ElementId of the shared parameter to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
-or-
parameterId is a parameter that is not bound to the Rebar element category.
Since:
2020

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.AddUpdatingSharedParameter(Autodesk.Revit.DB.ElementId)
Add existing shared parameter as a dependency for the calculation of the rebar curves.
Remarks:
The input parameter needs to be bound to the Rebar element
The rebar element needs to have a valid external server
parameterId:
ElementId of the shared parameter to be added.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
-or-
parameterId is a parameter that is not bound to the Rebar element category.
Since:
2020